NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A120F1536GM48.svd
        <register>
          <name>PHDMODCTRL</name>
          <description>No Description</description>
          <addressOffset>0x24C</addressOffset>
          <access>read-write</access>
          <resetValue>0x01DF0004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PMDETTHD</name>
              <description>Preamble Detection Thrshould</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMTIMLOSTHD</name>
              <description>Preamble Timing loss thrshold</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMTIMLOSEN</name>
              <description>Preamble timing loss detection </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSIFLTBYP</name>
              <description>Bypass RSSI Filering</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMDETEN</name>
              <description>PREAMBLE DET</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REMODOSR</name>
              <description>REMOD INPUT OSR</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REMODDWN</name>
              <description>REMOD downsampling ratio</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REMODOUTSEL</name>
              <description>REMOD OUTPUT Selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REMODEN</name>
              <description>REMOD ENABLE</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCRDETECTOR</name>
              <description>Enbale BCRDMOD Dtetector ONLY</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCRTRECSCONC</name>
              <description>BCR/LEGACY CONCURRENT MODE</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCRLEGACYCONC</name>
              <description>BCR/TRECS CONCURRENT MODE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SICTRL0</name>
          <description>No Description</description>
          <addressOffset>0x250</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>Signal Identifier Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Signal identifier feature disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZB</name>
                  <description>Zigbee detection mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE2</name>
                  <description>BLE2 detection mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE1</name>
                  <description>BLE1 detection mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOISETHRESH</name>
              <description>Noise threshold</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAKNUMTHRESHLW</name>
              <description>Peak number threshold long window</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEAKNUMTHRESHSW</name>
              <description>Peak number threshold short window</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMALLSAMPLETHRESH</name>
              <description>Small sample threshold</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQNOMINAL</name>
              <description>Freq nominal number</description>
              <bitOffset>23</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SICTRL1</name>
          <description>No Description</description>
          <addressOffset>0x254</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUPERCHIPTOLERANCE</name>
              <description>Superchip freq dev tolerance</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUPERCHIPMEDIAN</name>
              <description>Superchip freq dev median value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRTHRESH</name>
              <description>Correlator threshold</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRNUM</name>
              <description>Correlation over threshold number</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTMODE</name>
              <description>Zigbee fast mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NARROWPULSETHRESH</name>
              <description>Narrow pulse threshold</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SISTATUS</name>
          <description>No Description</description>
          <addressOffset>0x258</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x67FFFFFF</resetMask>
          <fields>
            <field>
              <name>SISTATE</name>
              <description>SI main FSM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NOISE</name>
              <description>Noisy short window</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LWPEAKCOUNT</name>
              <description>Peak count</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NARROWCOUNT</name>
              <description>Narrow pulse count</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMELOCK</name>
              <description>Timing locked</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUPERCHIPFAIL</name>
              <description>Superchip fail</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUPERCHIPPASS</name>
              <description>Superchip pass</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMEOFFSET</name>
              <description>Timing offset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORRPASSNUM</name>
              <description>CORR success num</description>
              <bitOffset>21</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNIFFDONE</name>
              <description>Sniff done</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SIDET</name>
              <description>Signal detected</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGANTPATTEXT</name>
          <description>No Description</description>
          <addressOffset>0x25C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFGANTPATTVALEXT</name>
              <description>extra CFGANTPATTVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SICTRL2</name>
          <description>No Description</description>
          <addressOffset>0x264</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>SIRSTAGCMODE</name>
              <description>SI reset by AGC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIRSTPRSMODE</name>
              <description>SI reset by PRS PAEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIRSTCCAMODE</name>
              <description>SI reset by CCA req</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUPERCHIPTHRESH</name>
              <description>Superchip pass threshold</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISSIFRAMEDET</name>
              <description>Disable SI when framedet</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGCRSTUPONSI</name>
              <description>AGC reset on SI reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHFSWCTRL</name>
          <description>No Description</description>
          <addressOffset>0x268</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>CHFSWTIME</name>
              <description>Channel Filter Switch Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCAL</name>
          <description>No Description</description>
          <addressOffset>0x270</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFBF</resetMask>
          <fields>
            <field>
              <name>IRCALEN</name>
              <description>IRCAL enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MURSHF</name>
              <description>MUR shift value</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUISHF</name>
              <description>MUI shift value</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRCORREN</name>
              <description>IR Correction enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRCALCOEFRSTCMD</name>
              <description>IRCAL coef reset cmd</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IRCALIFADCDBG</name>
              <description>IRCAL IFADC DBG</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCALCOEF</name>
          <description>No Description</description>
          <addressOffset>0x274</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <fields>
            <field>
              <name>CRV</name>
              <description>CRV coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CIV</name>
              <description>CIV coefficient</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCALCOEFWR0</name>
          <description>No Description</description>
          <addressOffset>0x278</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRVWD</name>
              <description>CRV coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWD</name>
              <description>CIV coefficient</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCALCOEFWR1</name>
          <description>No Description</description>
          <addressOffset>0x27C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRVWD</name>
              <description>CRV coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWD</name>
              <description>CIV coefficient</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRL1</name>
          <description>No Description</description>
          <addressOffset>0x280</addressOffset>
          <access>read-write</access>
          <resetValue>0x00080000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCTRL1</name>
              <description>AD control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRL2</name>
          <description>No Description</description>
          <addressOffset>0x284</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCTRL2</name>
              <description>ADPC control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADQUAL0</name>
          <description>No Description</description>
          <addressOffset>0x288</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF03FF</resetMask>
          <fields>
            <field>
              <name>ADRSSI0</name>
              <description>ANT0 RSSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADRSSI1</name>
              <description>ANT1 RSSI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADQUAL1</name>
          <description>No Description</description>
          <addressOffset>0x28C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCORR0</name>
              <description>ANT0 CORR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADSTAT1</name>
              <description>ADSTAT1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADQUAL2</name>
          <description>No Description</description>
          <addressOffset>0x290</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF03FF</resetMask>
          <fields>
            <field>
              <name>ADRSSI0P</name>
              <description>Previous ANT0 RSSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADRSSI1P</name>
              <description>Previous ANT1 RSSI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
